{
    "login_h": "Přihlášení",
    "welcome_p": "Piš si soukromě se svým kamarádem, kterému tato aplikace běží na vlastním serveru s plným end to end šifrováním dat!",
    "deploy_link": "Nasadit na vlastní instanci",
    "username_label": "Uživatelské jméno",
    "username_input_placeholder": "Zadejte své uživatelské jméno",
    "password_label": "Heslo",
    "password_input_placeholder": "Zadejte své heslo",
    "dont_have_account": "Nemáš ještě účet?",
    "have_account": "Máš už účet?",
    "login_button": "Přihlásit se",
    "switch_to_login": "Přihlásit se",
    "switch_to_sign_up": "Zaregistrovat se",
    "password_mismatch": "Hesla se neshodují",
    "login_failed": "Neplatné přihlašovací údaje",
    "private_key_not_in_cookies": "Soukromý klíč nebyl nalezen v cookies",
    "enter_private_key": "Zadejte prosím svůj soukromý klíč",
    "signup_failed": "Registrace se nezdařila; Uživatelské jméno může již být používáno někým jiným",
    "signup_h": "Registrace",
    "confirm_password_label": "Potvrzení hesla",
    "confirm_password_input_placeholder": "Potvrďte své heslo",
    "signup_info_1": "Vytvořením účtu vygenerujete na svém zařízení pouze v tomto prohlížeči na této stránce lokálně soukromý a veřejný klíč pro šifrování vašich dat, soukromý klíč nikdy neopustí vaše zařízení, naše servery nikdy nebudou znát jeho hodnotu.",
    "signup_info_2": "Toto děláme hlavně proto, aby se pokaždé, když někomu pošlete zprávu, zpráva nejprve podepsala tvým soukromým klíčem a poté zašifrovala veřejným klíčem osoby, které zprávu posíláte, takže ji může dešifrovat pouze jeho soukromý klíč, který má jen on. Pokud bude schopen dešifrovat zprávu pomocí svého soukromého klíče, může také pomocí vašeho veřejného klíče, (který jako váš kontant automaticky má) ověřit, že zpráva byla skutečně od vás.",
    "signup_info_3": "Algoritmy pgp veřejných klíčů také používáme pro autentizaci přihlašování: Veřejný klíč ukládáme v šifrované podobě, kterou můžeme dešifrovat, abychom vás mohli vždy ověřit.",
    "signup_info_4": "Toto vám poskytne dvoufaktorové ověření bez použití telefonu nebo e-mailu.",
    "signup_info_5": "Fungovat to bude tak, že vaše přihlašovací údaje budou vždy odeslány na náš server zašifrované soukromým klíčem, takže je lze dešifrovat pouze veřejným klíčem, váš uživatel v databázi bude také vytvořen pomocí šifrování SCRAM-SHA256, takže nikdy nebudeme uchovávat vaše přihlašovací údaje v žádném námi dešifrovatelném formátu, musíte si pamatovat své heslo a nikdy neztratit svůj soukromý klíč, abyste byli schopni se přihlásit.",
    "signup_info_6": "Při registraci budete přihlášeni do chatovací komponenty, kde také dostanete zrušitelné vyskakovací okno o specifikacích klíče, které si můžete kdykoli znovu zobrazit kliknutím na tlačítko klíče.",
    "signup_info_7": "Tohle vše se může zdát jako hrozná otrava. Všechny ostatní aplikace nám umožňují neustále zapomínát všechna naše hesla, ale tady nesmíme zapomenout heslo a musíme uchovávat soukromý klíč. To je ale jediný způsob, jak můžeš mít skutečné soukromí v online aplikaci, kterou používáš. Jediný způsob, jakým nemůžeme mít žádná zadní vrátka do tvého účtu.",
    "signup_info_8": "Zobrazení klíčů bude nejprve skryté, můžeš si je zobrazit, ale dělej to pouze, když můžeš mít nějakou jistotu, že tvůj/tvá monitor/obrazovka není žádným způsobem nahráván/a.",
    "signup_info_9": "Klíč si také můžeš zkopírovat, aniž bys ho vizuálně zobrazoval na stránce.",
    "signup_info_10": "Soukromý klíč bude uložen do tvých strict cookies pro tuto stránku, ale rozhodně by sis měl svůj soukromý klíč také uložit do nějakého bezpečného správce hesel, ideálně do několika z nich na záložních zařízeních, aby sis mohl být jist, že svůj soukromý klíč netratíš.",
    "signup_info_11": "Získání vašeho soukromého klíče někým jiným není takový problém, jak by se mohlo zdát, protože s ním samotným vám nikdo nemůže nic udělat.",
    "signup_info_12": "Ty sám s ním samotným nemůžeš dělat nebo vidět nic.",
    "signup_info_13": "Musíš mít přístup ke svým datům, abys mohl dešifrovat hodnoty svých dat pomocí svého soukromého klíče; A k těm se dostaneš pouze prostřednictvím ověření do aplikace, pro které potřebuješ nejen soukromý klíč, ale i heslo.",
    "signup_info_14": "Ale i když sám o sobě tvůj soukromý klíč není k ničemu: Pokud máš podezření, že ho někdo zná, měl byses co nejdřív přihlásit a vygenerovat nové klíče: Bude k tomu k dispozici tlačítko, které také na tvém zařízení dešifruje všechna data pomocí tvého soukromého klíče, vygeneruje nové klíče, zašifruje je novým veřejným klíčem, smaže starý soukromý klíč z vašich cookies (pokud ho tam máte), uloží nový klíč tam, pošle zprávu na server, aby smazal starý veřejný klíč a všechny hodnoty s ním zašifrované, a nahradil je nově zašifrovanýmy hodnotami na tvém zařízení novým veřejným klíčem, který bude také uložen stejným šifrovaným způsobem jako předtím.",
    "signup_info_15": "Při přihlašování ve výchozím režimu bude proces přihlašování pokračovat pouze tehdy, pokud je tvůj soukromý klíč v cookies, aby na vašem zařízení zašifroval jméno a heslo, takže je možné je odeslat na server, kde budou dešifrovány veřejným klíčem, který je uložen pod tvým jménem, takže tě může přihlásit na tvůj účet v postgres databázi přes pool, abys měl přístup ke svému osobnímu schématu v databázi.",
    "signup_info_16": "Pokud to bude úspěšné, budeš ověřen.",
    "signup_info_17": "Jediná data, která bude server schopen dešifrovat, budou od koho jsou které šifrované zprávy poslány komu: To je nutné pro to, aby server byl schopen odesílat zprávy od jednoho uživatele druhému, ale neboj se, již máš plnou anonymitu toho, co komukoli posíláš, a můžeš mít i anonymitu toho, komu posíláš šifrované zprávy/soubory/jména souborů tím, že si vybereš alias místo jakéhokoli jména, které by nějakým způsobem popisovalo tvoji skutečnou identitu.",
    "signup_button": "Zaregistrovat se",
    "signout_button": "Odhlásit se",
    "more_options_toggle": "Další možnosti",
    "theme_toggle": "Přepnout téma",
    "theme_toggle_light_dropdown_menu_item": "Světlé",
    "theme_toggle_dark_dropdown_menu_item": "Tmavé",
    "theme_toggle_system_dropdown_menu_item": "Systém",
    "lang_toggle": "Přepnout jazyk",
    "lang_toggle_english_dropdown_menu_item": "Angličtina",
    "lang_toggle_czech_dropdown_menu_item": "Čeština",
    "private_key_to_strict_cookies_alert_dialog_title": "Uložit soukromý klíč do strict cookies",
    "private_key_to_strict_cookies_alert_dialog_description": "Uložit soukromý klíč do strict cookies",
    "private_key_to_strict_cookies_button": "Uložit soukromý klíč do cookies",
    "download_img": "Stáhnout obrázek",
    "display_keys_popup_dialog_title": "Vaše pgp klíče",
    "display_keys_dialog_description_1": "Jak již víš, nemůžeš si dovolit ztratit svůj soukromý klíč, takže jej zkopíruj a zazálohuj v nějakém bezpečném správci hesel.",
    "display_keys_dialog_description_2": "Ujisti se, že při zobrazení klíčů není monitor nijak nahráván.",
    "display_keys_button_public_key_to_clipboard": "Zkopírovat Veřejný Klíč do schránky",
    "display_keys_button_private_key_to_clipboard": "Zkopírovat YSoukromý Klíč do schránky",
    "display_keys_button_show_public_key": "Zobrazit veřejný klíč",
    "display_keys_button_show_private_key": "Zobrazit soukromý klíč"
}
